; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v13 ?v1)
             (pred_9 ?v4 ?v12)
             (pred_1 ?v13 ?v12)
             (pred_8 ?v5 ?v13 )
	     (pred_7 ?v13)
             (pred_10 ?v6)
             (pred_5 ?v4)
             (pred_3 ?v12)
             (pred_11 ?v13)
             (pred_2 ?v4)
             (pred_12 ?v13)
             (pred_6 ))



(:action op_5
:parameters (?v8 ?v10 ?v11 ?v2)
:precondition (and (pred_10 ?v8) (pred_10 ?v10) (pred_5 ?v11) (pred_3 ?v2)
          (pred_4 ?v8 ?v10) (pred_9 ?v11 ?v2)
                   (pred_1 ?v10 ?v2) (pred_7 ?v8) 
                   (pred_11 ?v10) (pred_2 ?v11))
:effect (and  (pred_12 ?v10) (not (pred_11 ?v10))))


(:action op_3
:parameters (?v8 ?v7)
:precondition (and (pred_10 ?v8) (pred_10 ?v7)
               (pred_7 ?v8) (pred_4 ?v8 ?v7) (pred_12 ?v7))
:effect (and (pred_7 ?v7) (not (pred_7 ?v8))))

(:action op_2
:parameters (?v8 ?v11)
:precondition (and (pred_10 ?v8) (pred_5 ?v11) 
                  (pred_7 ?v8) (pred_8 ?v11 ?v8) (pred_6 ))
:effect (and (pred_2 ?v11)
   (not (pred_8 ?v11 ?v8)) (not (pred_6 ))))


(:action op_4
:parameters (?v8 ?v3 ?v9)
:precondition (and (pred_10 ?v8) (pred_5 ?v3) (pred_5 ?v9)
                  (pred_7 ?v8) (pred_2 ?v9) (pred_8 ?v3 ?v8))
:effect (and (pred_2 ?v3) (pred_8 ?v9 ?v8)
        (not (pred_2 ?v9)) (not (pred_8 ?v3 ?v8))))

(:action op_1
:parameters (?v8 ?v11)
:precondition (and (pred_10 ?v8) (pred_5 ?v11) 
                  (pred_7 ?v8) (pred_2 ?v11))
:effect (and (pred_6 ) (pred_8 ?v11 ?v8) (not (pred_2 ?v11)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_21 obj_17 obj_14 obj_18 obj_04 obj_16 obj_11 obj_19 obj_08 obj_02 obj_03 obj_15 obj_20 obj_10 obj_13
    obj_05 obj_09
    obj_07 obj_12 obj_06
    )

    (:init
       (pred_6)

       (pred_10 obj_01)
       (pred_10 obj_21)
       (pred_10 obj_17)
       (pred_10 obj_14)
       (pred_10 obj_18)
       (pred_10 obj_04)
       (pred_10 obj_16)
       (pred_10 obj_11)
       (pred_10 obj_19)
       (pred_10 obj_08)
       (pred_10 obj_02)
       (pred_10 obj_03)
       (pred_10 obj_15)
       (pred_10 obj_20)
       (pred_10 obj_10)
       (pred_10 obj_13)
       (pred_3 obj_05)
       (pred_3 obj_09)
       (pred_5 obj_07)
       (pred_5 obj_12)
       (pred_5 obj_06)

       (pred_4 obj_01 obj_18)
       (pred_4 obj_01 obj_21)
       (pred_4 obj_21 obj_04)
       (pred_4 obj_21 obj_17)
       (pred_4 obj_21 obj_01)
       (pred_4 obj_17 obj_16)
       (pred_4 obj_17 obj_14)
       (pred_4 obj_17 obj_21)
       (pred_4 obj_14 obj_11)
       (pred_4 obj_14 obj_17)
       (pred_4 obj_18 obj_19)
       (pred_4 obj_18 obj_04)
       (pred_4 obj_18 obj_01)
       (pred_4 obj_04 obj_08)
       (pred_4 obj_04 obj_16)
       (pred_4 obj_04 obj_21)
       (pred_4 obj_04 obj_18)
       (pred_4 obj_16 obj_02)
       (pred_4 obj_16 obj_11)
       (pred_4 obj_16 obj_17)
       (pred_4 obj_16 obj_04)
       (pred_4 obj_11 obj_03)
       (pred_4 obj_11 obj_14)
       (pred_4 obj_11 obj_16)
       (pred_4 obj_19 obj_15)
       (pred_4 obj_19 obj_08)
       (pred_4 obj_19 obj_18)
       (pred_4 obj_08 obj_20)
       (pred_4 obj_08 obj_02)
       (pred_4 obj_08 obj_04)
       (pred_4 obj_08 obj_19)
       (pred_4 obj_02 obj_10)
       (pred_4 obj_02 obj_03)
       (pred_4 obj_02 obj_16)
       (pred_4 obj_02 obj_08)
       (pred_4 obj_03 obj_13)
       (pred_4 obj_03 obj_11)
       (pred_4 obj_03 obj_02)
       (pred_4 obj_15 obj_20)
       (pred_4 obj_15 obj_19)
       (pred_4 obj_20 obj_10)
       (pred_4 obj_20 obj_08)
       (pred_4 obj_20 obj_15)
       (pred_4 obj_10 obj_13)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_10 obj_20)
       (pred_4 obj_13 obj_03)
       (pred_4 obj_13 obj_10)
       (pred_11 obj_10)
       (pred_11 obj_03)
       (pred_11 obj_02)
       (pred_1  obj_10 obj_05)
       (pred_1  obj_03 obj_09)
       (pred_1  obj_02 obj_05)
       (pred_12 obj_01)
       (pred_12 obj_21)
       (pred_12 obj_17)
       (pred_12 obj_14)
       (pred_12 obj_18)
       (pred_12 obj_04)
       (pred_12 obj_16)
       (pred_12 obj_11)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_15)
       (pred_12 obj_20)
       (pred_12 obj_13)

       (pred_9  obj_07 obj_05)
       (pred_9  obj_12 obj_09)
       (pred_9  obj_06 obj_09)
       (pred_8 obj_07 obj_14)
       (pred_8 obj_12 obj_14)
       (pred_8 obj_06 obj_01)
       (pred_7 obj_18)
    )

    (:goal (and
       (pred_8 obj_12 obj_21)
       (pred_8 obj_06 obj_20)
    ))
(:constraints
  (always (not (pred_7 obj_04)))
)
)

; plan
1. (op_3 obj_18 obj_01)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_01)
   goals met: 0 of 2
2. (op_2 obj_01 obj_06)
   deleted: (pred_8 obj_06 obj_01) (pred_6)
   added: (pred_2 obj_06)
   goals met: 0 of 2
3. (op_3 obj_01 obj_21)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_21)
   goals met: 0 of 2
4. (op_3 obj_21 obj_17)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_17)
   goals met: 0 of 2
5. (op_3 obj_17 obj_14)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_14)
   goals met: 0 of 2
6. (op_4 obj_14 obj_12 obj_06)
   deleted: (pred_2 obj_06) (pred_8 obj_12 obj_14)
   added: (pred_2 obj_12) (pred_8 obj_06 obj_14)
   goals met: 0 of 2
7. (op_3 obj_14 obj_17)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_17)
   goals met: 0 of 2
8. (op_3 obj_17 obj_21)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_21)
   goals met: 0 of 2
9. (op_1 obj_21 obj_12)
   deleted: (pred_2 obj_12)
   added: (pred_6) (pred_8 obj_12 obj_21)
   goals met: 1 of 2
10. (op_3 obj_21 obj_17)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_17)
   goals met: 1 of 2
11. (op_3 obj_17 obj_14)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_14)
   goals met: 1 of 2
12. (op_2 obj_14 obj_06)
   deleted: (pred_8 obj_06 obj_14) (pred_6)
   added: (pred_2 obj_06)
   goals met: 1 of 2
13. (op_3 obj_14 obj_17)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_17)
   goals met: 1 of 2
14. (op_3 obj_17 obj_21)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_21)
   goals met: 1 of 2
15. (op_3 obj_21 obj_01)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_01)
   goals met: 1 of 2
16. (op_3 obj_01 obj_18)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_18)
   goals met: 1 of 2
17. (op_3 obj_18 obj_19)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_19)
   goals met: 1 of 2
18. (op_3 obj_19 obj_08)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_08)
   goals met: 1 of 2
19. (op_3 obj_08 obj_20)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_20)
   goals met: 1 of 2
20. (op_1 obj_20 obj_06)
   deleted: (pred_2 obj_06)
   added: (pred_6) (pred_8 obj_06 obj_20)
   goals met: 2 of 2
